In [1]:
import pandas as pd
from sqlalchemy import create_engine

### Extract CSVs into DataFrames

In [3]:
csv_file = "../Resources/zomato_zip.csv"
zomato_zip_df = pd.read_csv(csv_file, encoding='latin-1')
zomato_zip_df.dtypes

Zip Code                 object
Restaurant ID             int64
Restaurant Name          object
Country Code              int64
City                     object
Address                  object
Locality                 object
Locality Verbose         object
Longitude               float64
Latitude                float64
Cuisines                 object
Average Cost for two      int64
Currency                 object
Has Table booking        object
Has Online delivery      object
Is delivering now        object
Switch to order menu     object
Price range               int64
Aggregate rating        float64
Rating color             object
Rating text              object
Votes                     int64
dtype: object

In [5]:
new_zomato_df = zomato_zip_df[['Zip Code', 'City', 'Cuisines', 'Average Cost for two', 'Price range']]
new_zomato_df.head()

,Zip Code,City,Cuisines,Average Cost for two,Price range
0,08542,Princeton,Seafood,70,4
1,26062,Weirton,"Burger, Greek, Sandwich",25,2
2,29841,Augusta,"Breakfast, French",40,3
3,30501,Gainesville,"Sandwich, Seafood, Cajun",25,2
4,30501,Gainesville,Thai,10,1

In [7]:
zomato_df = new_zomato_df.rename(columns={'Zip Code': 'ZIPCODE'})
zomato_df.head()

,ZIPCODE,City,Cuisines,Average Cost for two,Price range
0,08542,Princeton,Seafood,70,4
1,26062,Weirton,"Burger, Greek, Sandwich",25,2
2,29841,Augusta,"Breakfast, French",40,3
3,30501,Gainesville,"Sandwich, Seafood, Cajun",25,2
4,30501,Gainesville,Thai,10,1

### Transform premise DataFrame

In [8]:
connection = 'postgres:1difalatty@localhost:5432/zomato_db'
engine = create_engine(f'postgresql://{connection}')

In [10]:
zomato_df.to_sql(name='cost', con=engine, if_exists='append', index=False)

In [11]:
engine.table_names()

['cost']

In [12]:
pd.read_sql_query('SELECT * FROM cost;', con=engine).head()

,ZIPCODE,City,Cuisines,Average Cost for two,Price range
0,08542,Princeton,Seafood,70,4
1,26062,Weirton,"Burger, Greek, Sandwich",25,2
2,29841,Augusta,"Breakfast, French",40,3
3,30501,Gainesville,"Sandwich, Seafood, Cajun",25,2
4,30501,Gainesville,Thai,10,1